; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 852267 2 2 3 7 4
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	spectrograph0 - mode
	image1 - mode
	thermograph2 - mode
	Star0 - direction
	Star1 - direction
	Star2 - direction
	Star5 - direction
	Star4 - direction
	GroundStation6 - direction
	Star3 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Planet10 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 thermograph2)
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation6)
	(calibration_target instrument0 Star4)
	(supports instrument1 image1)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
	(supports instrument2 spectrograph0)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 Star3)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star1)
)
(:goal (and
	(pointing satellite0 Star4)
	(have_image Planet7 spectrograph0)
	(have_image Phenomenon8 image1)
	(have_image Star9 thermograph2)
	(have_image Planet10 thermograph2)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 5
3. (turn_to satellite0 star4 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star4)
   goals met: 1 of 5
4. (turn_to satellite1 star3 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 star3)
   goals met: 1 of 5
5. (calibrate satellite0 instrument0 star4)
   added: (calibrated instrument0)
   goals met: 1 of 5
6. (calibrate satellite1 instrument2 star3)
   added: (calibrated instrument2)
   goals met: 1 of 5
7. (turn_to satellite0 star9 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star9)
   goals met: 0 of 5
8. (turn_to satellite1 planet7 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 planet7)
   goals met: 0 of 5
9. (take_image satellite0 star9 instrument0 thermograph2)
   added: (have_image star9 thermograph2)
   goals met: 1 of 5
10. (take_image satellite1 planet7 instrument2 spectrograph0)
   added: (have_image planet7 spectrograph0)
   goals met: 2 of 5
11. (turn_to satellite0 star4 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star4)
   goals met: 3 of 5
12. (turn_to satellite1 planet10 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 planet10)
   goals met: 3 of 5
13. (take_image satellite1 planet10 instrument2 thermograph2)
   added: (have_image planet10 thermograph2)
   goals met: 4 of 5
14. (turn_to satellite0 phenomenon8 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 phenomenon8)
   goals met: 3 of 5
15. (take_image satellite0 phenomenon8 instrument0 image1)
   added: (have_image phenomenon8 image1)
   goals met: 4 of 5
16. (turn_to satellite0 star4 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 star4)
   goals met: 5 of 5
